/* Классы, отвечающие за взаимодействие с различными API */

/* Обязательных классов, взаимодействующих с API, должно быть два:
MainApi. Отвечает за взаимодействие с написанным вами Node.js API.
Конструктор этого класса принимает опции, необходимые для инициализации работы с API.
Вот список обязательных методов:
signup регистрирует нового пользователя;
signin аутентифицирует пользователя на основе почты и пароля;
getUserData возвращает информацию о пользователе;
getArticles забирает все статьи;
createArticle создаёт статью;
removeArticle удаляет статью.
*/

/* export default class MainApi {
  constructor() {

  }

  signup() {}

  signin() {}

  getUserData() {}

  getArticles() {}

  createArticle() {}

  removeArticle() {}
} */
